//--------------------------------------------------------------------------------
//
//--------------------------------------------------------------------------------
#ifndef FLASH_H
#define FLASH_H
//--------------------------------------------------------------------------------
typedef struct
{
	uint32_t    time_interval_16;           // интервал дворника
	uint32_t    time_washout_32;            // время помывки
	uint32_t    time_pause_washout_32;      // время между помывками
	uint32_t    preset_washout_32;          // пресет помывки
	uint32_t	time_preset_washout_32;     // времен помывки
} tpSettings;
tpSettings settings;
//--------------------------------------------------------------------------------
#endif
